Revit 2027 API
MechanicalUtils.ConnectAirTerminalOnDuct Method
 Connects an air terminal to a duct directly (without the need for a tee or takeoff).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ConnectAirTerminalOnDuct(
	Document document,
	ElementId airTerminalId,
	ElementId ductCurveId
)
Public Shared Function ConnectAirTerminalOnDuct (
	document As Document,
	airTerminalId As ElementId,
	ductCurveId As ElementId
) As Boolean
public:
static bool ConnectAirTerminalOnDuct(
	Document^ document,
	ElementId^ airTerminalId,
	ElementId^ ductCurveId
)
static member ConnectAirTerminalOnDuct :
        document : Document *
        airTerminalId : ElementId *
        ductCurveId : ElementId -> bool
Parameters
document Document
 The document.
airTerminalId ElementId
 The air terminal id.
ductCurveId ElementId
 The duct curve id.
Return Value
Boolean
 True if connection succeeds, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The familyinstance is not air terminal. -or- The element is not duct curve. -or- The air terminal already has physical connection. -or- The air terminal connector origin doesn't project within the center line of the duct.
ArgumentNullException |  A non-optional argument was null
Remarks
 The current location of the air terminal will be projected to the duct centerline, and if the point can be successfully projected, the air terminal will be placed on the most suitable face of the duct.
See Also
Reference
MechanicalUtils Class
Autodesk.Revit.DB.Mechanical Namespace